{"pageProps":{"postData":{"id":"the-business-model-sketch","contentHtml":"<p>I was helping a friend work through some business ideas, and realized that like writing an outline helps you structure a essay, doing a \"business model sketch\" can help you break apart a business idea and evaluate its viability. Just like an essay needs a thesis, a body and a conclusion or it can fall flat, a business model needs specific components or it is not viable. I identified six components that roughly draw from The Personal MBA and the \"lean startup\" philosophy. If you are thinking of starting a new business, consider taking one page of paper, drawing six boxes, and filling out these six areas: customer, value proposition, marketing, sales, value delivery, and finance.</p>\n<p>The problem with many business ideas is that, while they sometimes hit on a few of these areas, they are weak in others. That can be okay, but as a startup, your goal should be to develop a plan about how to address your idea's weak points, and quickly test whether that plan is viable. If it is, great! If not, reconsider or proceed with caution!</p>\n<p>Ideally, focus your value proposition on addressing core human drives. The Personal MBA identifies five core human drives: the drives to acquire, bond, learn, defend, and feel. Many consumer products clearly target their value propositions to these core human drives. This can be difficult if you are not selling consumer products or services, but if you look closely, many business-to-business or business-to-government sales are targeted the same way. Living in Washington, DC I notice this every time I go through the Pentagon metro station. Large defense contractors clearly target their buyer's core human drive to defend with advertisements that depict the strength and sophistication of their offerings. This example of advertisements for Northrop Grumman's unmanned drones is a great example.</p>\n<p>In the marketing portion of your sketch, you should also attempt to identify in rough terms the market size and dynamics: how many potential customers do you have and is that number increasing and/or gaining purchasing power?</p>\n<p>Sales and marketing are closely intertwined, but separating them out to different boxes in the business model sketch should help you to separate the act of reaching your customer and delivering your value proposition (marketing) and the mechanics of \"closing the deal\" (sales).</p>\n","layout":"post","status":"publish","published":true,"title":"The Business Model Sketch","author":{"display_name":"afiedler","login":"afiedler","email":"andy@andyfiedler.com","url":""},"author_login":"afiedler","author_email":"andy@andyfiedler.com","wordpress_id":229,"wordpress_url":"http://andyfiedler.com/?p=229","date":"2014-04-22 09:25:19 -0400","date_gmt":"2014-04-22 13:25:19 -0400","categories":["Startups"],"tags":[]}},"__N_SSG":true}