{"pageProps":{"postData":{"id":"two-new-cool-tools-for-technology-consultants","contentHtml":"<h4>1) InVision and Sketch</h4>\nI've been making a lot of simple prototypes in the last few weeks, and the combination of tools that has been working best for me is <a href=\"http://bohemiancoding.com/sketch/\" target=\"_blank\">Sketch 3</a> and <a href=\"http://www.invisionapp.com/\" target=\"_blank\">InVision</a>. Sketch is a simple drawing program like Illustrator that you can use to make mockups. It allows you to have one file with multiple pages, which you can use for multiple screens in your app.\n<p>InVision is a very simple online tool to create clickable prototypes. There are lots of these tools, and here is a good comparison, but for me, InVision has been working best because it is very simple. The way InVision works is you upload a bunch of screens and then draw boxes on them that become \"hotlinks\" to navigate to other screens. You cannot make more complex interactions, like with a tool like Axure, but for the simple prototypes I have been doing, this is all I need. You can learn to use InVision in about 10 minutes, while it took me 3-4 hours to figure out what the heck was going with Axure (not to knock Axure; it's very powerful and is the right tool for the job sometimes).</p>\n<p>The cool thing with the pair of InVision and Sketch is that you can just drag and drop your Sketch file into InVision, and InVision will create or <em>update</em> your screens. That means your revision workflow is very easy: make or update drawings in Sketch → save the file → drag the file to InVision.</p>\n<p>{% picture wp/uploads/2015/03/Screen-Shot-2015-03-06-at-10.10.32-AM.png %}</p>\n<p> </p>\n<h4>2) IPython, IRuby, Jupyter</h4>\nIf you have ever used a REPL and wished it had more of a GUI, you should definitely check out <a href=\"http://ipython.org/\" target=\"_blank\">IPython</a> or <a href=\"https://github.com/minad/iruby\" target=\"_blank\">IRuby</a> (and the upcoming project <a href=\"http://jupyter.org/\" target=\"_blank\">Jupyter</a>). I used IPython in the past, but I've been mostly coding Ruby recently. I didn't realize that there is a very good Ruby counterpart called IRuby that is extremely powerful.\n<p>It turns out that IPython is morphing into Jupyter, which aims to be language-agnostic. This could be very cool: think IPython for NodeJS, R, or other languages, and more front-ends that work with any language!</p>\n<p>{% picture wp/uploads/2015/03/Screen-Shot-2015-03-06-at-10.14.12-AM.png %}</p>\n","layout":"post","status":"publish","published":true,"title":"Two Cool Tools for Technology Consultants","author":{"display_name":"afiedler","login":"afiedler","email":"andy@andyfiedler.com","url":""},"author_login":"afiedler","author_email":"andy@andyfiedler.com","wordpress_id":300,"wordpress_url":"http://andyfiedler.com/?p=300","date":"2015-03-06 10:16:44 -0500","date_gmt":"2015-03-06 15:16:44 -0500","categories":["Tech Notes"],"tags":["consulting"]}},"__N_SSG":true}