{"pageProps":{"postData":{"id":"single-page-app-hosting","contentHtml":"<p>If you are working on an MVP web app these days, chances are you are using a single page app (SPA) framework like Angular, React, or EmberJS. These frameworks are great for a lot of reasons, one being that you can typically host the front-end with just a static file webserver like NGINX or Apache.</p>\n<p>Maintaining a webserver is still probably not the best use of your time when you are trying to get your MVP out the door, and hosting a SPA is a little more complex than just a static HTML site. There are a lot of shortcuts out there (such as using Amazon S3) and a few hosted platforms are emerging. Read on to see a comparison of the current solutions, and leave a comment if you know of any others!</p>\n<p>So what's my recommendation? If don't need your app to be indexed on Google, show previews on Facebook's Open Graph, or show cards on Twitter, both Firebase Hosting and Aerobatic are good options. In theory, Googlebot is starting to crawl SPAs, but in practice I have not had good luck with that. The other crawlers seem to be far behind Google, so you'll likely need pre-rendered pages, anyway.</p>\n<p>If you do need to support bots by serving pre-rendered HTML, you are unfortunately at a real loss. I think your best option in that case is to host your front-end on Heroku (using NGINX, Express, Hapi, or some other simple server), and use a service like Prerender.io to serve pre-rendered HTML to bots. See here for how you would set up Prerender.io using NGINX. Alternatively, you can let the Firebase Hosting guys know that you really want pre-rendering support in this PR.</p>\n","layout":"post","status":"publish","published":true,"title":"Where Should I Host My Single Page App?","author":{"display_name":"afiedler","login":"afiedler","email":"andy@andyfiedler.com","url":""},"author_login":"afiedler","author_email":"andy@andyfiedler.com","wordpress_id":345,"wordpress_url":"http://andyfiedler.com/?p=345","date":"2015-11-12 10:45:44 -0500","date_gmt":"2015-11-12 15:45:44 -0500","categories":["Tech Notes"],"tags":["devops","single page apps","hosting"],"redirect_from":["/blog/single-page-app-hosting-345/","/blog/single-page-app-hosting-345"]}},"__N_SSG":true}