{"pageProps":{"postData":{"id":"hacking-sleep","contentHtml":"<p>I've been hearing more and more about the importance of sleep, so as part of trying to be healthier in general I decided to see what I could do to sleep better. A lot of the stuff I tried is based on Tim Ferriss’s <a href=\"http://www.amazon.com/The-4-Hour-Body-Incredible-Superhuman/dp/0307704610\"><em>Four Hour Body</em></a>, and I'd definitely recommend the chapter on sleep to anyone who is interested in hacking theirs, too.</p>\n<p>I organized these by what I think worked the best for me, but since I tried a lot of things at once, it's hard to tease out the differences.</p>\n<h2>Make your bedroom as dark as possible</h2>\n<p>My apartment is in a historic building, so the facade is lit up at night. While it looks impressive, it makes my bedroom bright even with blackout curtains. What I did to fix this was unfurl a blackout curtain and tack it to the edges of the window so there is practically no light that comes in. By no light, I mean I cannot even see my hand in front of my face. It does not look great, but it works!</p>\n<p>Try this first: remove all electronics with lights (even small LEDs) and black out your windows. Use a heavy blanket or aluminum foil and tape. It will look terrible, but if it helps, you can invest in better curtains later.</p>\n<h2>Test 66-70F degrees as your bedroom temperature, with a thin blanket</h2>\n<p>This is from the <em>Four Hour Body</em> and it really made a big difference for me. 64 degrees and I'll wake up shivering, 72 degrees and I'll sweat and wake up mildly dehydrated. Try 68 with a sheet and maybe a light blanket.</p>\n<p>Also, thermostats can be widely inaccurate so you might want to get a more accurate thermometer to test this. For example, if I set my thermostat to 65 degrees, its actually 72 in my bedroom. Try <a href=\"http://www.amazon.com/gp/product/B0013BKDO8\">this one</a> that I was using for a few months. It doesn't really seem to help except maybe on the margins in the darkest days of winter.</p>\n<h2>Humidity level was more important than I thought</h2>\n<p>I went skiing in the mountains a few weeks ago and got a cold due to the very dry air. I also slept really poorly. I thought - maybe humidity is screwing up my sleep at home, too.</p>\n<p>I had a humidifier that I never used, so I decided to try it. Turns out 40-45% relative humidity is ideal. This is also a narrow band like temperature. Below 40% and I'll wake up with a dry throat and over 50% and everything feels somewhat damp in the morning. I actually sleep pretty well at 50-55% humidity, but I'm concerned about mold growing at that high of a level.</p>\n<h2>Eat almond butter on a carrot before bed</h2>\n<p>This idea is also from the <em>Four Hour Body</em>. A lot times when I woke up feeling sluggish in the morning, I'd feel better after eating breakfast. I figured this was definitely blood sugar related, so I tried another 4HB suggestion-almond butter before bed.</p>\n<p>This worked well and mostly eliminated that groggy mornings. I found that the easiest way to do this was to buy a bag of carrots and a jar of almond butter. Eat one to two carrots, “double dipping” in the almond butter so you get the equivalent of three to four tablespoons. The carrots are great because there will be no spoons or plates to clean up, and takes less than 5 minutes.</p>\n<h2>Things that haven't caused much of a difference for me</h2>\n<p>Photo credit: punch drunk</p>\n","layout":"post","status":"publish","published":true,"title":"Hacking Sleep","author":{"display_name":"afiedler","login":"afiedler","email":"andy@andyfiedler.com","url":""},"author_login":"afiedler","author_email":"andy@andyfiedler.com","wordpress_id":298,"wordpress_url":"http://andyfiedler.com/?p=298","date":"2015-02-27 10:34:00 -0500","date_gmt":"2015-02-27 15:34:00 -0500","categories":["Healthy Living"],"tags":["sleep"]}},"__N_SSG":true}